Documents/АгрегацияКодовМаркировкиСУЗИСМПТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>АгрегацияКодовМаркировкиСУЗИСМПТК</Name>
			<Comment>Отчет об агрегации кодов маркировки</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияИдентификационныйНомер</Name>
					<Comment>participantId</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПроизводственнойЛинии</Name>
					<Comment>productionLineId - дополнительное поле для табака / фармы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПроизводственногоЗаказа</Name>
					<Comment>productionOrderId - дополнительное поле для табака / фармы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OrderID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиОтчетовСУЗИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовСУЗИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУпаковокИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Упаковки</Name>
					<Comment>AggregationUnit</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификационныйКодЕдиницыАгрегации</Name>
							<Comment>Полный код маркировки (base64)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодИдентификацииУпаковки</Name>
							<Comment>Код идентификации (unitSerialNumber)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕмкостьУпаковки</Name>
							<Comment>aggregationUnitCapacity</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическоеКоличествоШтук</Name>
							<Comment>aggregatedItemsCount</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАгрегации</Name>
							<Comment>aggregationType</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыАгрегацииИСМПТК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АгрегированныеКМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураИСМПТК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатурыИСМПТК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодИдентификации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EAN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукцииИС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПродукцииИСМПТК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTINВерхнегоУровня</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыОбработкиОтчетовСУЗИСМПТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыОбработкиОтчетовСУЗИСМПТК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
					<Comment>PENDING</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправке</Name>
					<Comment>READY_TO_SEND</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
					<Comment>REJECTED</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
					<Comment>SENT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыУпаковокИСМПТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыУпаковокИСМПТК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Логистическая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Групповая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Потребительская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АкцизнаяМаркаСНомеромИСерией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АгрегированныйТаможенныйКод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПродукцииИСМПТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыПродукцииИСМПТК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алкогольная</Name>
					<Comment>alcohol</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табачная</Name>
					<Comment>tobacco</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обувная</Name>
					<Comment>shoes</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АльтернативныйТабак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛекарственныеПрепараты</Name>
					<Comment>pharma</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукция</Name>
					<Comment>milk</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольныеНапитки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АгрегацияКодовМаркировкиСУЗИСМПТК/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Удаляет использованные коды маркировки из пула в случаях:
//   * Все коды маркировки по основанию распечатаны, основание полностью оформлено (по основанию)
//   * Основание не указано или архивировано, коды маркировки распечатаны (по использованным кодам).
//
Процедура ПолучитьИнформациюПоСтатусамАгрегации() Экспорт
	
	НастройкаОбменаСУЗ = ИнтерфейсИСМПТК.НастройкиОбменаСУЗ();
	
	Если НастройкаОбменаСУЗ = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Для организации ""%1"" не определена настройка взаимодействия с СУЗ'");
		ТекстСообщения = ИнтеграцияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения);
		
		ИнтеграцияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстСообщения,  "Ошибка регламентного задания обновление статусов документов СУЗ");
		
	Иначе
		
		Если ТипЗнч(НастройкаОбменаСУЗ) = Тип("Массив") Тогда
			Для Каждого Настройка Из НастройкаОбменаСУЗ Цикл
				ПолучитьИнформациюПоСтатусамАгрегацииПродолжить(Настройка);
			КонецЦикла;
		Иначе
			ПолучитьИнформациюПоСтатусамАгрегацииПродолжить(НастройкаОбменаСУЗ);
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьИнформациюПоСтатусамАгрегацииПродолжить(НастройкаОбменаСУЗ)
	
	Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	АгрегацияКодовМаркировкиСУЗИСМПТК.OrderID КАК OrderID,
		|	АгрегацияКодовМаркировкиСУЗИСМПТК.Статус КАК Статус,
		|	АгрегацияКодовМаркировкиСУЗИСМПТК.Ссылка КАК Ссылка,
		|	АгрегацияКодовМаркировкиСУЗИСМПТК.ВидПродукции КАК ВидПродукции
		|ИЗ
		|	Документ.АгрегацияКодовМаркировкиСУЗИСМПТК КАК АгрегацияКодовМаркировкиСУЗИСМПТК
		|ГДЕ
		|	НЕ АгрегацияКодовМаркировкиСУЗИСМПТК.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиОтчетовСУЗИСМПТК.Отклонен)
		|	И НЕ АгрегацияКодовМаркировкиСУЗИСМПТК.OrderID = &ПустаяСтрока";
		
		Запрос.УстановитьПараметр("ПустаяСтрока", "");
		
		Результат = Запрос.Выполнить();
		
		ОтветСервера = Неопределено;
		
		Если Не Результат.Пустой() Тогда 
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл 
				
				ОтветСервера = ИнтерфейсИСМПТК.ПолучитьСтатусАгрегацииКМ(НастройкаОбменаСУЗ, Выборка.ВидПродукции, Выборка.OrderID);
				
				Если Не ЗначениеЗаполнено(ОтветСервера.ТекстОшибки) Тогда
					
					СтатусОтчета 			= ИнтерфейсИСМПТК.СтатусОбработкиОтчета(ОтветСервера.ДанныеОСтатусах["reportStatus"]);
					Если Не Выборка.Статус = СтатусОтчета Тогда 
						ДокументОбъект 			= Выборка.Ссылка.ПолучитьОбъект();
						ДокументОбъект.Статус 	= СтатусОтчета;
						
						Попытка
							ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
						Исключение
							ТекстСообщения = НСтр("ru = 'При записи документа ""%1"" произошла ошибка и документу не был присвоен изменённый статус ""%2""'");
							ТекстСообщения = ИнтеграцияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения,
							ДокументОбъект,
							СтатусОтчета);
							
							ИнтеграцияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстСообщения, "Ошибка регламентного задания ""Обновление статусов документов СУЗ""");
							
						КонецПопытки;
					КонецЕсли;
					
				Иначе
					
					ИнтеграцияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ОтветСервера.ТекстОшибки);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не ОтветСервера = Неопределено Тогда
			Если ЗначениеЗаполнено(ОтветСервера.ТекстОшибки) Тогда
				ИнтеграцияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ОтветСервера.ТекстОшибки,  "Ошибка регламентного задания ""Обновление статусов документов СУЗ""");
			КонецЕсли;
		КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АгрегацияКМ";
	КомандаПечати.Представление = НСтр("ru = 'Агрегация кодов маркировки'");
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если ПечатьКодовМаркировкиИСМПТКПереопределяемый.НужноПечататьМакет(КоллекцияПечатныхФорм, "АгрегацияКМ") Тогда
		
		ПечатнаяФорма = СформироватьПечатнуюФормуАгрегацияКМ(МассивОбъектов, ОбъектыПечати);
		
		ПечатьКодовМаркировкиИСМПТКПереопределяемый.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"АгрегацияКМ",
			НСтр("ru = 'Агрегация кодов маркировки'"),
			ПечатнаяФорма,
			,
			"Документ.АгрегацияКодовМаркировкиСУЗИСМПТК.ПФ_MXL_АгрегированныеТовары");
	КонецЕсли;
		
КонецПроцедуры

Функция СформироватьПечатнуюФормуАгрегацияКМ(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ТекстЗапросаПоТоварам = ПечатьКодовМаркировкиИСМПТКПереопределяемый.ТекстЗапросаПечатьАгрегацияКодовМаркировки();
	Запрос.Текст = ТекстЗапросаПоТоварам;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаРеквизиты  = РезультатыЗапроса[0].Выбрать();
	ВыборкаКоды 	  = РезультатыЗапроса[1].Выбрать();
	
	Макет = ПечатьКодовМаркировкиИСМПТКПереопределяемый.МакетПечатнойФормы("Документ.АгрегацияКодовМаркировкиСУЗИСМПТК.ПФ_MXL_АгрегированныеТовары");
	РеквизитыДокумента = Новый Структура("Номер, Дата, Организация, ОрганизацияИдентификационныйНомер, ВидПродукции, ВидУпаковки, Ответственный");

	Эталон = Обработки.ПечатьКодовМаркировкиИСМПТК.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	УровеньЧеткости = 1;
		
	Пока ВыборкаРеквизиты.Следующий() Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаРеквизиты);
		
		Если ВыборкаРеквизиты.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИСМПТК.Логистическая") Тогда
			//Для кода SSCC
			ИмяОбласти  = "ОбластьКодАгрегатаSSCC";
			ТипКода 	= 2;
			ИмяКартинки = "КартинкаШтрихкодаSSCC";
		Иначе
			//Для кода GS1 DataMatrix
			ИмяОбласти  = "ОбластьКодАгрегатаDataMatrix";
			ТипКода 	= 24;
			ИмяКартинки = "КартинкаШтрихкодаDataMatrix";
		КонецЕсли;
		
		//Штрихкод агрегата
		ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
		ЗначениеШтрихкодаДляКомпоненты = РазборИОбработкаКодовМаркировкиИСМПТКСлужебный.КодGS1ДляКомпонентыПечати(
										 РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.Base64ВШтрихкод(ВыборкаРеквизиты.ИдентификационныйКодЕдиницыАгрегации), ТипКода);
		Высота = ОбластьКартинка.Рисунки[ИмяКартинки].Высота;
		Ширина = ОбластьКартинка.Рисунки[ИмяКартинки].Ширина;
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",           Окр(Ширина / КоличествоМиллиметровВПикселе) * УровеньЧеткости);
		ПараметрыШтрихкода.Вставить("Высота",          (Окр(Высота / КоличествоМиллиметровВПикселе) * УровеньЧеткости) + 2);
		ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкодаДляКомпоненты);
		ПараметрыШтрихкода.Вставить("ТипКода",         ТипКода);
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
		ПараметрыШтрихкода.Вставить("НеGS1", 		   Ложь); //"Истина" только при генерации штрихкода табачной потребительской упаковки. В коде агрегата ее не может оказаться
		
		ОбластьКартинка.Рисунки[ИмяКартинки].Картинка = ПечатьКодовМаркировкиИСМПТКВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		
		//Вывод дополнительного поля значения КМ агрегата
		Если НЕ ВыборкаРеквизиты.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИСМПТК.Логистическая") Тогда
			//ОбластьКартинка.Параметры.КодАгрегата = РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.Base64ВШтрихкод(ВыборкаРеквизиты.ИдентификационныйКодЕдиницыАгрегации);
			ОбластьКартинка.Параметры.КодАгрегата = ВыборкаРеквизиты.КодИдентификацииУпаковки;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьКартинка);
		
		//Заголовок
		Область = Макет.ПолучитьОбласть("Заголовок");
		ТекстЗаголовка = НСтр("ru='Агрегация кодов маркировки '") + ВыборкаРеквизиты.Номер + " от " + ВыборкаРеквизиты.Дата; 
		Область.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(Область);
		
		//Данные шапки
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.ПредставлениеОрганизации 			= ВыборкаРеквизиты.Организация;
		Область.Параметры.ОрганизацияИдентификационныйНомер = ВыборкаРеквизиты.ОрганизацияИдентификационныйНомер;
		Область.Параметры.Ответственный 					= ВыборкаРеквизиты.Ответственный;
		ТабличныйДокумент.Вывести(Область);
		
		//Данные упаковки
		Область = Макет.ПолучитьОбласть("ДанныеУпаковки");
		Область.Параметры.ВидПродукции = ВыборкаРеквизиты.ВидПродукции;
		Область.Параметры.ВидУпаковки  = ВыборкаРеквизиты.ВидУпаковки;
		Область.Параметры.ЕмкостьУпаковки 			= ВыборкаРеквизиты.ЕмкостьУпаковки;
		Область.Параметры.ФактическоеКоличествоШтук = ВыборкаРеквизиты.ФактическоеКоличествоШтук;
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
	Пока ВыборкаКоды.Следующий() Цикл
		
		//Данные строки
		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Область.Параметры.НомерСтроки  = ВыборкаКоды.НомерСтроки;
		Область.Параметры.GTIN  	   = ВыборкаКоды.GTIN;
		
		ПредставлениеНоменклатуры = "";
		Если ЗначениеЗаполнено(ВыборкаКоды.ПредставлениеНоменклатуры) Тогда
			ПредставлениеНоменклатуры = ПредставлениеНоменклатуры + ВыборкаКоды.ПредставлениеНоменклатуры;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаКоды.ПредставлениеХарактеристики) Тогда
			ПредставлениеНоменклатуры = ПредставлениеНоменклатуры + " (" + ВыборкаКоды.ПредставлениеХарактеристики + ")";
		КонецЕсли;
		Область.Параметры.Номенклатура = ПредставлениеНоменклатуры;
		
		Область.Параметры.КодИдентификации = ВыборкаКоды.КодИдентификации;
		Если РазборИОбработкаКодовМаркировкиИСМПТКСлужебный.ЭтоКодSSCC(ВыборкаКоды.КодИдентификации) Тогда
			//Это транспортный код
			ТипКода = 2;
		Иначе 
			Если РеквизитыДокумента.ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.Табачная") 
				И РеквизитыДокумента.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИСМПТК.Групповая") Тогда 
				ТипКода = 18; //DataMatrix для табачных пачек
			Иначе
				ТипКода = 24; //GS1 DataMatrix для всех остальных кодов
			КонецЕсли;
		КонецЕсли;
				
		//Штрихкод кода маркировки
		ЗначениеШтрихкодаДляКомпоненты = РазборИОбработкаКодовМаркировкиИСМПТКСлужебный.КодGS1ДляКомпонентыПечати(
										 РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.Base64ВШтрихкод(ВыборкаКоды.КодМаркировки), ТипКода);
		Высота = Область.Рисунки.ШтрихкодКМ.Высота;
		Ширина = Область.Рисунки.ШтрихкодКМ.Ширина;
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",          Окр(Ширина / КоличествоМиллиметровВПикселе) * УровеньЧеткости);
		ПараметрыШтрихкода.Вставить("Высота",          Окр(Высота / КоличествоМиллиметровВПикселе) * УровеньЧеткости);
		ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкодаДляКомпоненты);
		ПараметрыШтрихкода.Вставить("ТипКода",         ТипКода);
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
		ПараметрыШтрихкода.Вставить("НеGS1", 		   Ложь); //для ТипКода = 2 это значение игнорируется, для ТипКода = 24 - Ложь. 
				
		Область.Рисунки.ШтрихкодКМ.Картинка = ПечатьКодовМаркировкиИСМПТКВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ТабличныйДокумент.Вывести(Область);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область СтандартныеПодсистемы

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	ИнтеграцияИСМПТКПереопределяемый.ПриЗаполненииОграниченияДоступа(Ограничение, "АгрегацияКодовМаркировкиСУЗИСМПТК");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
